app/Controllers/Main.php

    public function index()
    {
        // main
        $data = [];
        // load tasks from the database and the user in session
        $tasks_model = new TasksModel();
        $data['tasks'] = $tasks_model->where('id_user', session()->id)->findAll();
---
SELECT *
FROM `tasks`
WHERE `id_user` = '1'

    public function login_submit()
    {
        // form validation
        $validation = $this->validate(
            // validation rules
            [
                'text_usuario' => 'required',
                'text_senha' => 'required'
            ],
            // validation errors
            [
                'text_usuario' => ['required' => 'O campo usuário é obrigatório'],
                'text_senha' => ['required' => 'O campo senha é obrigatório']
            ]
        );
        if (!$validation) {
            return redirect()->to('login')->withInput()->with('validation_errors', $this->validator->getErrors());
        }
        // check if login is valid
        $usuario = $this->request->getPost('text_usuario');
        $senha = $this->request->getPost('text_senha');
        $usuario_model = new UsuariosModel();
        $usuario_data = $usuario_model->where('usuario', $usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'user2'
 LIMIT 1

    public function new_task_submit()
    {
        // form validation
        $validation = $this->validate([
            'text_tarefa' => [
                'label' => 'Nome da tarefa',
                'rules' => 'required|min_length[5]|max_length[200]',
                'errors' => [
                    'required' => 'O campo {field} é de preenchimento obrigatório',
                    'min_length' => 'O campo {field} deve ter no mínimo {param} caracteres.',
                    'max_length' => 'O campo {field} deve ter no máximo {param} caracteres.'
                ]
            ],
            'text_descricao' => [
                'label' => 'Descrição',
                'rules' => 'max_length[500]',
                'errors' => [
                    'max_length' => 'O campo {field} deve ter no máximo {param} caracteres.'
                ]
            ]
        ]);
        if (!$validation) {
            return redirect()->back()->withInput()->with('validation_errors', $this->validator->getErrors());
        }
        // get form data
        $titulo = $this->request->getPost('text_tarefa');
        $descricao = $this->request->getPost('text_descricao');
        // insert data
        $tasks_model = new TasksModel();
        $tasks_model->insert([
            'id_user' => session()->id,
            'task_name' => $titulo,
            'task_description' => $descricao,
            'task_status' => 'new'
        ]);
---
INSERT INTO `tasks` (`id_user`, `task_name`, `task_description`, `task_status`, `created_at`, `updated_at`) VALUES ('1', 'nova tarefa', '', 'new', '2024-12-24 16:48:19', '2024-12-24 16:48:19')

    public function search()
    {
        $data = [];
        // get search items
        $search_term = $this->request->getPost('text_search');
        // load tasks from the database and search items
        $tasks_model = new TasksModel();
        $data['tasks'] = $tasks_model->where('id_user', session()->id)->like('task_name', $search_term)->findAll();
---
SELECT *
FROM `tasks`
WHERE `id_user` = '1'
AND  `task_name` LIKE '%tarefa%' ESCAPE '!'

    public function filter($status)
    {
        $data = [];
        $tasks_model = new TasksModel();
        if ($status == 'all') {
            $data['tasks'] = $tasks_model->where('id_user', session()->id)->findAll();
        } else {
            $data['tasks'] = $tasks_model->where('id_user', session()->id)->where('task_status', $status)->findAll();
---
SELECT *
FROM `tasks`
WHERE `id_user` = '1'
SELECT *
FROM `tasks`
WHERE `id_user` = '1'
AND `task_status` = 'started'

    public function edit_task($enc_id)
    {
        // decrypt id
        $task_id = decrypt($enc_id);
        if (!$task_id) {
            return redirect()->to('/');
        }
        $data = [];
        // check for validation errors
        $validation_errors = session()->getFlashdata('validation_errors');
        if ($validation_errors) {
            $data['validation_errors'] = $validation_errors;
        }
        // load task data
        $tasks_model = new TasksModel();
        $task_data = $tasks_model->where('id', $task_id)->first();
---
SELECT *
FROM `tasks`
WHERE `id` = '16'
 LIMIT 1

        $status = $this->request->getPost('select_status');
        // load task data
        $tasks_model = new TasksModel();
        $task_data = $tasks_model->where('id', $task_id)->first();
---
SELECT *
FROM `tasks`
WHERE `id` = '11'
 LIMIT 1

            return redirect()->to('/');
        }
        // insert data in database
        $tasks_model->update($task_id, [
            'task_name' => $tarefa,
            'task_description' => $descricao,
            'task_status' => $status
        ]);
---
UPDATE `tasks` SET `task_name` = 'nova tarefa ALTERADA 11111', `task_description` = '', `task_status` = 'cancelled', `updated_at` = '2024-12-27 18:07:52'
WHERE `tasks`.`id` IN ('11')

    public function delete_task($enc_id)
    {
        // decrypt task id
        $task_id = decrypt($enc_id);
        if (!$task_id) {
            return redirect()->to('/');
        }
        // load task data
        $tasks_model = new TasksModel();
        $task_data = $tasks_model->where('id', $task_id)->first();
---
SELECT *
FROM `tasks`
WHERE `id` = '1'
 LIMIT 1

    public function delete_task_confirm($enc_id)
    {
        // decrypt task id
        $task_id = decrypt($enc_id);
        if (!$task_id) {
            return redirect()->to('/');
        }
        // load task data
        $tasks_model = new TasksModel();
        $task_data = $tasks_model->where('id', $task_id)->first();
        if (!$task_data) {
            return redirect()->to('/');
        }
        // check if task belong to user in the session
        if ($task_data->id_user != session()->id) {
            return redirect()->to('/');
        }
        $tasks_model->delete($task_id);
---
SELECT *
FROM `tasks`
WHERE `id` = '11'
 LIMIT 1
DELETE FROM `tasks`
WHERE `id` IN ('11')